Revit 2026 API

# MEPSupportFailures Properties

---

The BuiltInFailuresMEPSupportFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotMatchInstanceSizeToHostError | The instance of [Symbol] cannot be re-sized to match the host. |
|  | InstanceOutOfHostError | The instance of [Symbol] lost its host and will be deleted. |
|  | InstanceProfileNotMatchWithHostError | The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted. |
|  | TypeSizeNotMatchWithHostError | The [Symbol] does not match the size of the host. |

#### Reference

BuiltInFailuresMEPSupportFailures Class

Autodesk.Revit.DB Namespace